espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: read write control register */
/** Type of lp_sysreg_ctrl register
 *  lp_sysreg read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_sysreg : R/W; bitpos: [0]; default: 1;
         *  Configures lp_sysreg registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_sysreg:1;
        /** read_ree0_lp_sysreg : R/W; bitpos: [1]; default: 0;
         *  Configures lp_sysreg registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_sysreg:1;
        /** read_ree1_lp_sysreg : R/W; bitpos: [2]; default: 0;
         *  Configures lp_sysreg registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_sysreg:1;
        /** read_ree2_lp_sysreg : R/W; bitpos: [3]; default: 0;
         *  Configures lp_sysreg registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_sysreg:1;
        /** write_tee_lp_sysreg : R/W; bitpos: [4]; default: 1;
         *  Configures lp_sysreg registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_sysreg:1;
        /** write_ree0_lp_sysreg : R/W; bitpos: [5]; default: 0;
         *  Configures lp_sysreg registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_sysreg:1;
        /** write_ree1_lp_sysreg : R/W; bitpos: [6]; default: 0;
         *  Configures lp_sysreg registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_sysreg:1;
        /** write_ree2_lp_sysreg : R/W; bitpos: [7]; default: 0;
         *  Configures lp_sysreg registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_sysreg:1;
        /** lp_sysreg_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_sysreg peri_apm configuration
         */
        uint32_t lp_sysreg_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_sysreg_ctrl_reg_t;

/** Type of lp_aonclkrst_ctrl register
 *  lp_aonclkrst read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_aonclkrst : R/W; bitpos: [0]; default: 1;
         *  Configures lp_aonclkrst registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_aonclkrst:1;
        /** read_ree0_lp_aonclkrst : R/W; bitpos: [1]; default: 0;
         *  Configures lp_aonclkrst registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_aonclkrst:1;
        /** read_ree1_lp_aonclkrst : R/W; bitpos: [2]; default: 0;
         *  Configures lp_aonclkrst registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_aonclkrst:1;
        /** read_ree2_lp_aonclkrst : R/W; bitpos: [3]; default: 0;
         *  Configures lp_aonclkrst registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_aonclkrst:1;
        /** write_tee_lp_aonclkrst : R/W; bitpos: [4]; default: 1;
         *  Configures lp_aonclkrst registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_aonclkrst:1;
        /** write_ree0_lp_aonclkrst : R/W; bitpos: [5]; default: 0;
         *  Configures lp_aonclkrst registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_aonclkrst:1;
        /** write_ree1_lp_aonclkrst : R/W; bitpos: [6]; default: 0;
         *  Configures lp_aonclkrst registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_aonclkrst:1;
        /** write_ree2_lp_aonclkrst : R/W; bitpos: [7]; default: 0;
         *  Configures lp_aonclkrst registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_aonclkrst:1;
        /** lp_aonclkrst_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_aonclkrst peri_apm configuration
         */
        uint32_t lp_aonclkrst_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_aonclkrst_ctrl_reg_t;

/** Type of lp_anaperi_ctrl register
 *  lp_anaperi read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_anaperi : R/W; bitpos: [0]; default: 1;
         *  Configures lp_anaperi registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_anaperi:1;
        /** read_ree0_lp_anaperi : R/W; bitpos: [1]; default: 0;
         *  Configures lp_anaperi registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_anaperi:1;
        /** read_ree1_lp_anaperi : R/W; bitpos: [2]; default: 0;
         *  Configures lp_anaperi registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_anaperi:1;
        /** read_ree2_lp_anaperi : R/W; bitpos: [3]; default: 0;
         *  Configures lp_anaperi registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_anaperi:1;
        /** write_tee_lp_anaperi : R/W; bitpos: [4]; default: 1;
         *  Configures lp_anaperi registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_anaperi:1;
        /** write_ree0_lp_anaperi : R/W; bitpos: [5]; default: 0;
         *  Configures lp_anaperi registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_anaperi:1;
        /** write_ree1_lp_anaperi : R/W; bitpos: [6]; default: 0;
         *  Configures lp_anaperi registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_anaperi:1;
        /** write_ree2_lp_anaperi : R/W; bitpos: [7]; default: 0;
         *  Configures lp_anaperi registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_anaperi:1;
        /** lp_anaperi_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_anaperi peri_apm configuration
         */
        uint32_t lp_anaperi_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_anaperi_ctrl_reg_t;

/** Type of lp_huk_ctrl register
 *  lp_huk read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_huk : R/W; bitpos: [0]; default: 1;
         *  Configures lp_huk registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_huk:1;
        /** read_ree0_lp_huk : R/W; bitpos: [1]; default: 0;
         *  Configures lp_huk registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_huk:1;
        /** read_ree1_lp_huk : R/W; bitpos: [2]; default: 0;
         *  Configures lp_huk registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_huk:1;
        /** read_ree2_lp_huk : R/W; bitpos: [3]; default: 0;
         *  Configures lp_huk registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_huk:1;
        /** write_tee_lp_huk : R/W; bitpos: [4]; default: 1;
         *  Configures lp_huk registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_huk:1;
        /** write_ree0_lp_huk : R/W; bitpos: [5]; default: 0;
         *  Configures lp_huk registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_huk:1;
        /** write_ree1_lp_huk : R/W; bitpos: [6]; default: 0;
         *  Configures lp_huk registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_huk:1;
        /** write_ree2_lp_huk : R/W; bitpos: [7]; default: 0;
         *  Configures lp_huk registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_huk:1;
        /** lp_huk_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_huk peri_apm configuration
         */
        uint32_t lp_huk_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_huk_ctrl_reg_t;

/** Type of lp_pmu_ctrl register
 *  lp_pmu read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_pmu : R/W; bitpos: [0]; default: 1;
         *  Configures lp_pmu registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_pmu:1;
        /** read_ree0_lp_pmu : R/W; bitpos: [1]; default: 0;
         *  Configures lp_pmu registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_pmu:1;
        /** read_ree1_lp_pmu : R/W; bitpos: [2]; default: 0;
         *  Configures lp_pmu registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_pmu:1;
        /** read_ree2_lp_pmu : R/W; bitpos: [3]; default: 0;
         *  Configures lp_pmu registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_pmu:1;
        /** write_tee_lp_pmu : R/W; bitpos: [4]; default: 1;
         *  Configures lp_pmu registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_pmu:1;
        /** write_ree0_lp_pmu : R/W; bitpos: [5]; default: 0;
         *  Configures lp_pmu registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_pmu:1;
        /** write_ree1_lp_pmu : R/W; bitpos: [6]; default: 0;
         *  Configures lp_pmu registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_pmu:1;
        /** write_ree2_lp_pmu : R/W; bitpos: [7]; default: 0;
         *  Configures lp_pmu registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_pmu:1;
        /** lp_pmu_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_pmu peri_apm configuration
         */
        uint32_t lp_pmu_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_pmu_ctrl_reg_t;

/** Type of lp_touch_aon_ctrl register
 *  lp_touch_aon read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_touch_aon : R/W; bitpos: [0]; default: 1;
         *  Configures lp_touch_aon registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_touch_aon:1;
        /** read_ree0_lp_touch_aon : R/W; bitpos: [1]; default: 0;
         *  Configures lp_touch_aon registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_touch_aon:1;
        /** read_ree1_lp_touch_aon : R/W; bitpos: [2]; default: 0;
         *  Configures lp_touch_aon registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_touch_aon:1;
        /** read_ree2_lp_touch_aon : R/W; bitpos: [3]; default: 0;
         *  Configures lp_touch_aon registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_touch_aon:1;
        /** write_tee_lp_touch_aon : R/W; bitpos: [4]; default: 1;
         *  Configures lp_touch_aon registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_touch_aon:1;
        /** write_ree0_lp_touch_aon : R/W; bitpos: [5]; default: 0;
         *  Configures lp_touch_aon registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_touch_aon:1;
        /** write_ree1_lp_touch_aon : R/W; bitpos: [6]; default: 0;
         *  Configures lp_touch_aon registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_touch_aon:1;
        /** write_ree2_lp_touch_aon : R/W; bitpos: [7]; default: 0;
         *  Configures lp_touch_aon registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_touch_aon:1;
        /** lp_touch_aon_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_touch_aon peri_apm configuration
         */
        uint32_t lp_touch_aon_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_touch_aon_ctrl_reg_t;

