espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/** Type of lp_peri_pms_ctrl register
 *  lp_peri_pms read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_peri_pms : R/W; bitpos: [0]; default: 1;
         *  Configures lp_peri_pms registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_peri_pms:1;
        /** read_ree0_lp_peri_pms : HRO; bitpos: [1]; default: 0;
         *  Configures lp_peri_pms registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_peri_pms:1;
        /** read_ree1_lp_peri_pms : HRO; bitpos: [2]; default: 0;
         *  Configures lp_peri_pms registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_peri_pms:1;
        /** read_ree2_lp_peri_pms : HRO; bitpos: [3]; default: 0;
         *  Configures lp_peri_pms registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_peri_pms:1;
        /** write_tee_lp_peri_pms : R/W; bitpos: [4]; default: 1;
         *  Configures lp_peri_pms registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_peri_pms:1;
        /** write_ree0_lp_peri_pms : HRO; bitpos: [5]; default: 0;
         *  Configures lp_peri_pms registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_peri_pms:1;
        /** write_ree1_lp_peri_pms : HRO; bitpos: [6]; default: 0;
         *  Configures lp_peri_pms registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_peri_pms:1;
        /** write_ree2_lp_peri_pms : HRO; bitpos: [7]; default: 0;
         *  Configures lp_peri_pms registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_peri_pms:1;
        /** lp_peri_pms_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_peri_pms peri_apm configuration
         */
        uint32_t lp_peri_pms_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_peri_pms_ctrl_reg_t;

/** Type of lp_tee_ctrl register
 *  lp_tee read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_tee : R/W; bitpos: [0]; default: 1;
         *  Configures lp_tee registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_tee:1;
        /** read_ree0_lp_tee : HRO; bitpos: [1]; default: 0;
         *  Configures lp_tee registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_tee:1;
        /** read_ree1_lp_tee : HRO; bitpos: [2]; default: 0;
         *  Configures lp_tee registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_tee:1;
        /** read_ree2_lp_tee : HRO; bitpos: [3]; default: 0;
         *  Configures lp_tee registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_tee:1;
        /** write_tee_lp_tee : R/W; bitpos: [4]; default: 1;
         *  Configures lp_tee registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_tee:1;
        /** write_ree0_lp_tee : HRO; bitpos: [5]; default: 0;
         *  Configures lp_tee registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_tee:1;
        /** write_ree1_lp_tee : HRO; bitpos: [6]; default: 0;
         *  Configures lp_tee registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_tee:1;
        /** write_ree2_lp_tee : HRO; bitpos: [7]; default: 0;
         *  Configures lp_tee registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_tee:1;
        /** lp_tee_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_tee peri_apm configuration
         */
        uint32_t lp_tee_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_tee_ctrl_reg_t;

/** Type of lp_apm_ctrl register
 *  lp_apm read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_apm : R/W; bitpos: [0]; default: 1;
         *  Configures lp_apm registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_apm:1;
        /** read_ree0_lp_apm : HRO; bitpos: [1]; default: 0;
         *  Configures lp_apm registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_apm:1;
        /** read_ree1_lp_apm : HRO; bitpos: [2]; default: 0;
         *  Configures lp_apm registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_apm:1;
        /** read_ree2_lp_apm : HRO; bitpos: [3]; default: 0;
         *  Configures lp_apm registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_apm:1;
        /** write_tee_lp_apm : R/W; bitpos: [4]; default: 1;
         *  Configures lp_apm registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_apm:1;
        /** write_ree0_lp_apm : HRO; bitpos: [5]; default: 0;
         *  Configures lp_apm registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_apm:1;
        /** write_ree1_lp_apm : HRO; bitpos: [6]; default: 0;
         *  Configures lp_apm registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_apm:1;
        /** write_ree2_lp_apm : HRO; bitpos: [7]; default: 0;
         *  Configures lp_apm registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_apm:1;
        /** lp_apm_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_apm peri_apm configuration
         */
        uint32_t lp_apm_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_apm_ctrl_reg_t;

