espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/** Type of lp_timer_ctrl register
 *  lp_timer read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_timer : R/W; bitpos: [0]; default: 1;
         *  Configures lp_timer registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_timer:1;
        /** read_ree0_lp_timer : R/W; bitpos: [1]; default: 0;
         *  Configures lp_timer registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_timer:1;
        /** read_ree1_lp_timer : R/W; bitpos: [2]; default: 0;
         *  Configures lp_timer registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_timer:1;
        /** read_ree2_lp_timer : R/W; bitpos: [3]; default: 0;
         *  Configures lp_timer registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_timer:1;
        /** write_tee_lp_timer : R/W; bitpos: [4]; default: 1;
         *  Configures lp_timer registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_timer:1;
        /** write_ree0_lp_timer : R/W; bitpos: [5]; default: 0;
         *  Configures lp_timer registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_timer:1;
        /** write_ree1_lp_timer : R/W; bitpos: [6]; default: 0;
         *  Configures lp_timer registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_timer:1;
        /** write_ree2_lp_timer : R/W; bitpos: [7]; default: 0;
         *  Configures lp_timer registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_timer:1;
        /** lp_timer_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_timer peri_apm configuration
         */
        uint32_t lp_timer_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_timer_ctrl_reg_t;

/** Type of lp_wdt_ctrl register
 *  lp_wdt read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_wdt : R/W; bitpos: [0]; default: 1;
         *  Configures lp_wdt registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_wdt:1;
        /** read_ree0_lp_wdt : R/W; bitpos: [1]; default: 0;
         *  Configures lp_wdt registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_wdt:1;
        /** read_ree1_lp_wdt : R/W; bitpos: [2]; default: 0;
         *  Configures lp_wdt registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_wdt:1;
        /** read_ree2_lp_wdt : R/W; bitpos: [3]; default: 0;
         *  Configures lp_wdt registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_wdt:1;
        /** write_tee_lp_wdt : R/W; bitpos: [4]; default: 1;
         *  Configures lp_wdt registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_wdt:1;
        /** write_ree0_lp_wdt : R/W; bitpos: [5]; default: 0;
         *  Configures lp_wdt registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_wdt:1;
        /** write_ree1_lp_wdt : R/W; bitpos: [6]; default: 0;
         *  Configures lp_wdt registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_wdt:1;
        /** write_ree2_lp_wdt : R/W; bitpos: [7]; default: 0;
         *  Configures lp_wdt registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_wdt:1;
        /** lp_wdt_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_wdt peri_apm configuration
         */
        uint32_t lp_wdt_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_wdt_ctrl_reg_t;

/** Type of lp_clk_cali_sosc_ctrl register
 *  lp_clk_cali_sosc read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_clk_cali_sosc : R/W; bitpos: [0]; default: 1;
         *  Configures lp_clk_cali_sosc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_clk_cali_sosc:1;
        /** read_ree0_lp_clk_cali_sosc : R/W; bitpos: [1]; default: 0;
         *  Configures lp_clk_cali_sosc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_clk_cali_sosc:1;
        /** read_ree1_lp_clk_cali_sosc : R/W; bitpos: [2]; default: 0;
         *  Configures lp_clk_cali_sosc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_clk_cali_sosc:1;
        /** read_ree2_lp_clk_cali_sosc : R/W; bitpos: [3]; default: 0;
         *  Configures lp_clk_cali_sosc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_clk_cali_sosc:1;
        /** write_tee_lp_clk_cali_sosc : R/W; bitpos: [4]; default: 1;
         *  Configures lp_clk_cali_sosc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_clk_cali_sosc:1;
        /** write_ree0_lp_clk_cali_sosc : R/W; bitpos: [5]; default: 0;
         *  Configures lp_clk_cali_sosc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_clk_cali_sosc:1;
        /** write_ree1_lp_clk_cali_sosc : R/W; bitpos: [6]; default: 0;
         *  Configures lp_clk_cali_sosc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_clk_cali_sosc:1;
        /** write_ree2_lp_clk_cali_sosc : R/W; bitpos: [7]; default: 0;
         *  Configures lp_clk_cali_sosc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_clk_cali_sosc:1;
        /** lp_clk_cali_sosc_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_clk_cali_sosc peri_apm configuration
         */
        uint32_t lp_clk_cali_sosc_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_clk_cali_sosc_ctrl_reg_t;

