espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/** Type of lp_clk_cali_fosc_ctrl register
 *  lp_clk_cali_fosc read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_clk_cali_fosc : R/W; bitpos: [0]; default: 1;
         *  Configures lp_clk_cali_fosc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_clk_cali_fosc:1;
        /** read_ree0_lp_clk_cali_fosc : R/W; bitpos: [1]; default: 0;
         *  Configures lp_clk_cali_fosc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_clk_cali_fosc:1;
        /** read_ree1_lp_clk_cali_fosc : R/W; bitpos: [2]; default: 0;
         *  Configures lp_clk_cali_fosc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_clk_cali_fosc:1;
        /** read_ree2_lp_clk_cali_fosc : R/W; bitpos: [3]; default: 0;
         *  Configures lp_clk_cali_fosc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_clk_cali_fosc:1;
        /** write_tee_lp_clk_cali_fosc : R/W; bitpos: [4]; default: 1;
         *  Configures lp_clk_cali_fosc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_clk_cali_fosc:1;
        /** write_ree0_lp_clk_cali_fosc : R/W; bitpos: [5]; default: 0;
         *  Configures lp_clk_cali_fosc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_clk_cali_fosc:1;
        /** write_ree1_lp_clk_cali_fosc : R/W; bitpos: [6]; default: 0;
         *  Configures lp_clk_cali_fosc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_clk_cali_fosc:1;
        /** write_ree2_lp_clk_cali_fosc : R/W; bitpos: [7]; default: 0;
         *  Configures lp_clk_cali_fosc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_clk_cali_fosc:1;
        /** lp_clk_cali_fosc_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_clk_cali_fosc peri_apm configuration
         */
        uint32_t lp_clk_cali_fosc_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_clk_cali_fosc_ctrl_reg_t;

/** Type of lp_pwr_reg_ctrl register
 *  lp_pwr_reg read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_pwr_reg : R/W; bitpos: [0]; default: 1;
         *  Configures lp_pwr_reg registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_pwr_reg:1;
        /** read_ree0_lp_pwr_reg : R/W; bitpos: [1]; default: 0;
         *  Configures lp_pwr_reg registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_pwr_reg:1;
        /** read_ree1_lp_pwr_reg : R/W; bitpos: [2]; default: 0;
         *  Configures lp_pwr_reg registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_pwr_reg:1;
        /** read_ree2_lp_pwr_reg : R/W; bitpos: [3]; default: 0;
         *  Configures lp_pwr_reg registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_pwr_reg:1;
        /** write_tee_lp_pwr_reg : R/W; bitpos: [4]; default: 1;
         *  Configures lp_pwr_reg registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_pwr_reg:1;
        /** write_ree0_lp_pwr_reg : R/W; bitpos: [5]; default: 0;
         *  Configures lp_pwr_reg registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_pwr_reg:1;
        /** write_ree1_lp_pwr_reg : R/W; bitpos: [6]; default: 0;
         *  Configures lp_pwr_reg registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_pwr_reg:1;
        /** write_ree2_lp_pwr_reg : R/W; bitpos: [7]; default: 0;
         *  Configures lp_pwr_reg registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_pwr_reg:1;
        /** lp_pwr_reg_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_pwr_reg peri_apm configuration
         */
        uint32_t lp_pwr_reg_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_pwr_reg_ctrl_reg_t;

/** Type of lp_periclkrst_ctrl register
 *  lp_periclkrst read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_periclkrst : R/W; bitpos: [0]; default: 1;
         *  Configures lp_periclkrst registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_periclkrst:1;
        /** read_ree0_lp_periclkrst : R/W; bitpos: [1]; default: 0;
         *  Configures lp_periclkrst registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_periclkrst:1;
        /** read_ree1_lp_periclkrst : R/W; bitpos: [2]; default: 0;
         *  Configures lp_periclkrst registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_periclkrst:1;
        /** read_ree2_lp_periclkrst : R/W; bitpos: [3]; default: 0;
         *  Configures lp_periclkrst registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_periclkrst:1;
        /** write_tee_lp_periclkrst : R/W; bitpos: [4]; default: 1;
         *  Configures lp_periclkrst registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_periclkrst:1;
        /** write_ree0_lp_periclkrst : R/W; bitpos: [5]; default: 0;
         *  Configures lp_periclkrst registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_periclkrst:1;
        /** write_ree1_lp_periclkrst : R/W; bitpos: [6]; default: 0;
         *  Configures lp_periclkrst registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_periclkrst:1;
        /** write_ree2_lp_periclkrst : R/W; bitpos: [7]; default: 0;
         *  Configures lp_periclkrst registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_periclkrst:1;
        /** lp_periclkrst_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_periclkrst peri_apm configuration
         */
        uint32_t lp_periclkrst_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_periclkrst_ctrl_reg_t;

