espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/** Type of lp_iomux_ctrl register
 *  lp_iomux read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_iomux : R/W; bitpos: [0]; default: 1;
         *  Configures lp_iomux registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_iomux:1;
        /** read_ree0_lp_iomux : R/W; bitpos: [1]; default: 0;
         *  Configures lp_iomux registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_iomux:1;
        /** read_ree1_lp_iomux : R/W; bitpos: [2]; default: 0;
         *  Configures lp_iomux registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_iomux:1;
        /** read_ree2_lp_iomux : R/W; bitpos: [3]; default: 0;
         *  Configures lp_iomux registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_iomux:1;
        /** write_tee_lp_iomux : R/W; bitpos: [4]; default: 1;
         *  Configures lp_iomux registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_iomux:1;
        /** write_ree0_lp_iomux : R/W; bitpos: [5]; default: 0;
         *  Configures lp_iomux registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_iomux:1;
        /** write_ree1_lp_iomux : R/W; bitpos: [6]; default: 0;
         *  Configures lp_iomux registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_iomux:1;
        /** write_ree2_lp_iomux : R/W; bitpos: [7]; default: 0;
         *  Configures lp_iomux registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_iomux:1;
        /** lp_iomux_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_iomux peri_apm configuration
         */
        uint32_t lp_iomux_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_iomux_ctrl_reg_t;

/** Type of lp_intr_ctrl register
 *  lp_intr read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_intr : R/W; bitpos: [0]; default: 1;
         *  Configures lp_intr registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_intr:1;
        /** read_ree0_lp_intr : R/W; bitpos: [1]; default: 0;
         *  Configures lp_intr registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_intr:1;
        /** read_ree1_lp_intr : R/W; bitpos: [2]; default: 0;
         *  Configures lp_intr registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_intr:1;
        /** read_ree2_lp_intr : R/W; bitpos: [3]; default: 0;
         *  Configures lp_intr registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_intr:1;
        /** write_tee_lp_intr : R/W; bitpos: [4]; default: 1;
         *  Configures lp_intr registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_intr:1;
        /** write_ree0_lp_intr : R/W; bitpos: [5]; default: 0;
         *  Configures lp_intr registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_intr:1;
        /** write_ree1_lp_intr : R/W; bitpos: [6]; default: 0;
         *  Configures lp_intr registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_intr:1;
        /** write_ree2_lp_intr : R/W; bitpos: [7]; default: 0;
         *  Configures lp_intr registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_intr:1;
        /** lp_intr_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_intr peri_apm configuration
         */
        uint32_t lp_intr_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_intr_ctrl_reg_t;

/** Type of lp_efuse_ctrl register
 *  lp_efuse read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_efuse : R/W; bitpos: [0]; default: 1;
         *  Configures lp_efuse registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_efuse:1;
        /** read_ree0_lp_efuse : R/W; bitpos: [1]; default: 0;
         *  Configures lp_efuse registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_efuse:1;
        /** read_ree1_lp_efuse : R/W; bitpos: [2]; default: 0;
         *  Configures lp_efuse registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_efuse:1;
        /** read_ree2_lp_efuse : R/W; bitpos: [3]; default: 0;
         *  Configures lp_efuse registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_efuse:1;
        /** write_tee_lp_efuse : R/W; bitpos: [4]; default: 1;
         *  Configures lp_efuse registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_efuse:1;
        /** write_ree0_lp_efuse : R/W; bitpos: [5]; default: 0;
         *  Configures lp_efuse registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_efuse:1;
        /** write_ree1_lp_efuse : R/W; bitpos: [6]; default: 0;
         *  Configures lp_efuse registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_efuse:1;
        /** write_ree2_lp_efuse : R/W; bitpos: [7]; default: 0;
         *  Configures lp_efuse registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_efuse:1;
        /** lp_efuse_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_efuse peri_apm configuration
         */
        uint32_t lp_efuse_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_efuse_ctrl_reg_t;

/** Type of lp_uart_ctrl register
 *  lp_uart read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_uart : R/W; bitpos: [0]; default: 1;
         *  Configures lp_uart registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_uart:1;
        /** read_ree0_lp_uart : R/W; bitpos: [1]; default: 0;
         *  Configures lp_uart registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_uart:1;
        /** read_ree1_lp_uart : R/W; bitpos: [2]; default: 0;
         *  Configures lp_uart registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_uart:1;
        /** read_ree2_lp_uart : R/W; bitpos: [3]; default: 0;
         *  Configures lp_uart registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_uart:1;
        /** write_tee_lp_uart : R/W; bitpos: [4]; default: 1;
         *  Configures lp_uart registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_uart:1;
        /** write_ree0_lp_uart : R/W; bitpos: [5]; default: 0;
         *  Configures lp_uart registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_uart:1;
        /** write_ree1_lp_uart : R/W; bitpos: [6]; default: 0;
         *  Configures lp_uart registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_uart:1;
        /** write_ree2_lp_uart : R/W; bitpos: [7]; default: 0;
         *  Configures lp_uart registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_uart:1;
        /** lp_uart_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_uart peri_apm configuration
         */
        uint32_t lp_uart_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_uart_ctrl_reg_t;

/** Type of lp_i2c_ctrl register
 *  lp_i2c read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_i2c : R/W; bitpos: [0]; default: 1;
         *  Configures lp_i2c registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_i2c:1;
        /** read_ree0_lp_i2c : R/W; bitpos: [1]; default: 0;
         *  Configures lp_i2c registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_i2c:1;
        /** read_ree1_lp_i2c : R/W; bitpos: [2]; default: 0;
         *  Configures lp_i2c registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_i2c:1;
        /** read_ree2_lp_i2c : R/W; bitpos: [3]; default: 0;
         *  Configures lp_i2c registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_i2c:1;
        /** write_tee_lp_i2c : R/W; bitpos: [4]; default: 1;
         *  Configures lp_i2c registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_i2c:1;
        /** write_ree0_lp_i2c : R/W; bitpos: [5]; default: 0;
         *  Configures lp_i2c registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_i2c:1;
        /** write_ree1_lp_i2c : R/W; bitpos: [6]; default: 0;
         *  Configures lp_i2c registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_i2c:1;
        /** write_ree2_lp_i2c : R/W; bitpos: [7]; default: 0;
         *  Configures lp_i2c registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_i2c:1;
        /** lp_i2c_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_i2c peri_apm configuration
         */
        uint32_t lp_i2c_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_i2c_ctrl_reg_t;

/** Type of lp_spi_ctrl register
 *  lp_spi read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_spi : R/W; bitpos: [0]; default: 1;
         *  Configures lp_spi registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_spi:1;
        /** read_ree0_lp_spi : R/W; bitpos: [1]; default: 0;
         *  Configures lp_spi registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_spi:1;
        /** read_ree1_lp_spi : R/W; bitpos: [2]; default: 0;
         *  Configures lp_spi registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_spi:1;
        /** read_ree2_lp_spi : R/W; bitpos: [3]; default: 0;
         *  Configures lp_spi registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_spi:1;
        /** write_tee_lp_spi : R/W; bitpos: [4]; default: 1;
         *  Configures lp_spi registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_spi:1;
        /** write_ree0_lp_spi : R/W; bitpos: [5]; default: 0;
         *  Configures lp_spi registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_spi:1;
        /** write_ree1_lp_spi : R/W; bitpos: [6]; default: 0;
         *  Configures lp_spi registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_spi:1;
        /** write_ree2_lp_spi : R/W; bitpos: [7]; default: 0;
         *  Configures lp_spi registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_spi:1;
        /** lp_spi_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_spi peri_apm configuration
         */
        uint32_t lp_spi_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_spi_ctrl_reg_t;

/** Type of lp_i2cmst_ctrl register
 *  lp_i2cmst read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_i2cmst : R/W; bitpos: [0]; default: 1;
         *  Configures lp_i2cmst registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_i2cmst:1;
        /** read_ree0_lp_i2cmst : R/W; bitpos: [1]; default: 0;
         *  Configures lp_i2cmst registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_i2cmst:1;
        /** read_ree1_lp_i2cmst : R/W; bitpos: [2]; default: 0;
         *  Configures lp_i2cmst registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_i2cmst:1;
        /** read_ree2_lp_i2cmst : R/W; bitpos: [3]; default: 0;
         *  Configures lp_i2cmst registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_i2cmst:1;
        /** write_tee_lp_i2cmst : R/W; bitpos: [4]; default: 1;
         *  Configures lp_i2cmst registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_i2cmst:1;
        /** write_ree0_lp_i2cmst : R/W; bitpos: [5]; default: 0;
         *  Configures lp_i2cmst registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_i2cmst:1;
        /** write_ree1_lp_i2cmst : R/W; bitpos: [6]; default: 0;
         *  Configures lp_i2cmst registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_i2cmst:1;
        /** write_ree2_lp_i2cmst : R/W; bitpos: [7]; default: 0;
         *  Configures lp_i2cmst registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_i2cmst:1;
        /** lp_i2cmst_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_i2cmst peri_apm configuration
         */
        uint32_t lp_i2cmst_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_i2cmst_ctrl_reg_t;

/** Type of lp_trng_ctrl register
 *  lp_trng read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_trng : R/W; bitpos: [0]; default: 1;
         *  Configures lp_trng registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_trng:1;
        /** read_ree0_lp_trng : R/W; bitpos: [1]; default: 0;
         *  Configures lp_trng registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_trng:1;
        /** read_ree1_lp_trng : R/W; bitpos: [2]; default: 0;
         *  Configures lp_trng registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_trng:1;
        /** read_ree2_lp_trng : R/W; bitpos: [3]; default: 0;
         *  Configures lp_trng registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_trng:1;
        /** write_tee_lp_trng : R/W; bitpos: [4]; default: 1;
         *  Configures lp_trng registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_trng:1;
        /** write_ree0_lp_trng : R/W; bitpos: [5]; default: 0;
         *  Configures lp_trng registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_trng:1;
        /** write_ree1_lp_trng : R/W; bitpos: [6]; default: 0;
         *  Configures lp_trng registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_trng:1;
        /** write_ree2_lp_trng : R/W; bitpos: [7]; default: 0;
         *  Configures lp_trng registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_trng:1;
        /** lp_trng_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_trng peri_apm configuration
         */
        uint32_t lp_trng_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_trng_ctrl_reg_t;

/** Type of lp_adc_ctrl register
 *  lp_adc read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_adc : R/W; bitpos: [0]; default: 1;
         *  Configures lp_adc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_adc:1;
        /** read_ree0_lp_adc : R/W; bitpos: [1]; default: 0;
         *  Configures lp_adc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_adc:1;
        /** read_ree1_lp_adc : R/W; bitpos: [2]; default: 0;
         *  Configures lp_adc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_adc:1;
        /** read_ree2_lp_adc : R/W; bitpos: [3]; default: 0;
         *  Configures lp_adc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_adc:1;
        /** write_tee_lp_adc : R/W; bitpos: [4]; default: 1;
         *  Configures lp_adc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_adc:1;
        /** write_ree0_lp_adc : R/W; bitpos: [5]; default: 0;
         *  Configures lp_adc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_adc:1;
        /** write_ree1_lp_adc : R/W; bitpos: [6]; default: 0;
         *  Configures lp_adc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_adc:1;
        /** write_ree2_lp_adc : R/W; bitpos: [7]; default: 0;
         *  Configures lp_adc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_adc:1;
        /** lp_adc_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_adc peri_apm configuration
         */
        uint32_t lp_adc_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_adc_ctrl_reg_t;

/** Type of lp_touch_ctrl register
 *  lp_touch read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_touch : R/W; bitpos: [0]; default: 1;
         *  Configures lp_touch registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_touch:1;
        /** read_ree0_lp_touch : R/W; bitpos: [1]; default: 0;
         *  Configures lp_touch registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_touch:1;
        /** read_ree1_lp_touch : R/W; bitpos: [2]; default: 0;
         *  Configures lp_touch registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_touch:1;
        /** read_ree2_lp_touch : R/W; bitpos: [3]; default: 0;
         *  Configures lp_touch registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_touch:1;
        /** write_tee_lp_touch : R/W; bitpos: [4]; default: 1;
         *  Configures lp_touch registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_touch:1;
        /** write_ree0_lp_touch : R/W; bitpos: [5]; default: 0;
         *  Configures lp_touch registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_touch:1;
        /** write_ree1_lp_touch : R/W; bitpos: [6]; default: 0;
         *  Configures lp_touch registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_touch:1;
        /** write_ree2_lp_touch : R/W; bitpos: [7]; default: 0;
         *  Configures lp_touch registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_touch:1;
        /** lp_touch_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_touch peri_apm configuration
         */
        uint32_t lp_touch_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_touch_ctrl_reg_t;

