espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/** Type of lp_mailbox_ctrl register
 *  lp_mailbox read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_mailbox : R/W; bitpos: [0]; default: 1;
         *  Configures lp_mailbox registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_mailbox:1;
        /** read_ree0_lp_mailbox : R/W; bitpos: [1]; default: 0;
         *  Configures lp_mailbox registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_mailbox:1;
        /** read_ree1_lp_mailbox : R/W; bitpos: [2]; default: 0;
         *  Configures lp_mailbox registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_mailbox:1;
        /** read_ree2_lp_mailbox : R/W; bitpos: [3]; default: 0;
         *  Configures lp_mailbox registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_mailbox:1;
        /** write_tee_lp_mailbox : R/W; bitpos: [4]; default: 1;
         *  Configures lp_mailbox registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_mailbox:1;
        /** write_ree0_lp_mailbox : R/W; bitpos: [5]; default: 0;
         *  Configures lp_mailbox registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_mailbox:1;
        /** write_ree1_lp_mailbox : R/W; bitpos: [6]; default: 0;
         *  Configures lp_mailbox registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_mailbox:1;
        /** write_ree2_lp_mailbox : R/W; bitpos: [7]; default: 0;
         *  Configures lp_mailbox registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_mailbox:1;
        /** lp_mailbox_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_mailbox peri_apm configuration
         */
        uint32_t lp_mailbox_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_mailbox_ctrl_reg_t;

/** Type of lp_tsens_ctrl register
 *  lp_tsens read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_tsens : R/W; bitpos: [0]; default: 1;
         *  Configures lp_tsens registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_tsens:1;
        /** read_ree0_lp_tsens : R/W; bitpos: [1]; default: 0;
         *  Configures lp_tsens registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_tsens:1;
        /** read_ree1_lp_tsens : R/W; bitpos: [2]; default: 0;
         *  Configures lp_tsens registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_tsens:1;
        /** read_ree2_lp_tsens : R/W; bitpos: [3]; default: 0;
         *  Configures lp_tsens registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_tsens:1;
        /** write_tee_lp_tsens : R/W; bitpos: [4]; default: 1;
         *  Configures lp_tsens registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_tsens:1;
        /** write_ree0_lp_tsens : R/W; bitpos: [5]; default: 0;
         *  Configures lp_tsens registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_tsens:1;
        /** write_ree1_lp_tsens : R/W; bitpos: [6]; default: 0;
         *  Configures lp_tsens registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_tsens:1;
        /** write_ree2_lp_tsens : R/W; bitpos: [7]; default: 0;
         *  Configures lp_tsens registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_tsens:1;
        /** lp_tsens_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_tsens peri_apm configuration
         */
        uint32_t lp_tsens_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_tsens_ctrl_reg_t;

/** Type of lp_ahb_pdma_ctrl register
 *  lp_ahb_pdma read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_ahb_pdma : R/W; bitpos: [0]; default: 1;
         *  Configures lp_ahb_pdma registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_ahb_pdma:1;
        /** read_ree0_lp_ahb_pdma : R/W; bitpos: [1]; default: 0;
         *  Configures lp_ahb_pdma registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_ahb_pdma:1;
        /** read_ree1_lp_ahb_pdma : R/W; bitpos: [2]; default: 0;
         *  Configures lp_ahb_pdma registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_ahb_pdma:1;
        /** read_ree2_lp_ahb_pdma : R/W; bitpos: [3]; default: 0;
         *  Configures lp_ahb_pdma registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_ahb_pdma:1;
        /** write_tee_lp_ahb_pdma : R/W; bitpos: [4]; default: 1;
         *  Configures lp_ahb_pdma registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_ahb_pdma:1;
        /** write_ree0_lp_ahb_pdma : R/W; bitpos: [5]; default: 0;
         *  Configures lp_ahb_pdma registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_ahb_pdma:1;
        /** write_ree1_lp_ahb_pdma : R/W; bitpos: [6]; default: 0;
         *  Configures lp_ahb_pdma registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_ahb_pdma:1;
        /** write_ree2_lp_ahb_pdma : R/W; bitpos: [7]; default: 0;
         *  Configures lp_ahb_pdma registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_ahb_pdma:1;
        /** lp_ahb_pdma_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_ahb_pdma peri_apm configuration
         */
        uint32_t lp_ahb_pdma_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_ahb_pdma_ctrl_reg_t;

/** Type of lp_dac_ctrl register
 *  lp_dac read/write control register
 */
typedef union {
    struct {
        /** read_tee_lp_dac : R/W; bitpos: [0]; default: 1;
         *  Configures lp_dac registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_lp_dac:1;
        /** read_ree0_lp_dac : R/W; bitpos: [1]; default: 0;
         *  Configures lp_dac registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_lp_dac:1;
        /** read_ree1_lp_dac : R/W; bitpos: [2]; default: 0;
         *  Configures lp_dac registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_lp_dac:1;
        /** read_ree2_lp_dac : R/W; bitpos: [3]; default: 0;
         *  Configures lp_dac registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_lp_dac:1;
        /** write_tee_lp_dac : R/W; bitpos: [4]; default: 1;
         *  Configures lp_dac registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_lp_dac:1;
        /** write_ree0_lp_dac : R/W; bitpos: [5]; default: 0;
         *  Configures lp_dac registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_lp_dac:1;
        /** write_ree1_lp_dac : R/W; bitpos: [6]; default: 0;
         *  Configures lp_dac registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_lp_dac:1;
        /** write_ree2_lp_dac : R/W; bitpos: [7]; default: 0;
         *  Configures lp_dac registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_lp_dac:1;
        /** lp_dac_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock lp_dac peri_apm configuration
         */
        uint32_t lp_dac_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_peri_pms_lp_dac_ctrl_reg_t;


/** Group: PMS Register */
/** Type of lp_peri0_0 register
 *  LP_PERI0 PMS configuration & info register
 */
typedef union {
    struct {
        /** lp_peri0_pms_exception_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear lp_peri0 peri_pms_record_reg.
         *  0: No clear
         *  1: Clear peri_pms_record_reg
         */
        uint32_t lp_peri0_pms_exception_clr:1;
        /** lp_peri0_pms_exception_det : RO; bitpos: [1]; default: 0;
         *  Represents whether the lp_peri0 pms has been triggered.
         *  0: No triggered
         *  1: Has been triggered
         */
        uint32_t lp_peri0_pms_exception_det:1;
        /** lp_peri0_pms_exception_id : RO; bitpos: [7:2]; default: 0;
         *  Represents the master id when lp_peri0 pms has been triggered.
         */
        uint32_t lp_peri0_pms_exception_id:6;
        /** lp_peri0_pms_exception_mode : RO; bitpos: [9:8]; default: 0;
         *  Represents the security mode when lp_peri0 pms has been triggered.
         */
        uint32_t lp_peri0_pms_exception_mode:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} lp_peri_pms_lp_peri0_0_reg_t;

