espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_struct.h
/** Type of lp_peri0_1 register
 *  LP_PERI0 PMS exception addr record register
 */
typedef union {
    struct {
        /** lp_peri0_pms_exception_addr : RO; bitpos: [23:0]; default: 0;
         *  Represents the access address (bit27~bit0) when lp_peri0 pms has been triggered.
         */
        uint32_t lp_peri0_pms_exception_addr:24;
        /** lp_peri0_pms_exception_addr_const : HRO; bitpos: [31:24]; default: 32;
         *  Represents the access address (bit31~bit28) when lp_peri0 pms has been triggered.
         */
        uint32_t lp_peri0_pms_exception_addr_const:8;
    };
    uint32_t val;
} lp_peri_pms_lp_peri0_1_reg_t;

/** Type of lp_peri1_0 register
 *  LP_PERI1 PMS configuration & info register
 */
typedef union {
    struct {
        /** lp_peri1_pms_exception_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear lp_peri1 peri_pms_record_reg.
         *  0: No clear
         *  1: Clear peri_pms_record_reg
         */
        uint32_t lp_peri1_pms_exception_clr:1;
        /** lp_peri1_pms_exception_det : RO; bitpos: [1]; default: 0;
         *  Represents whether the lp_peri1 pms has been triggered.
         *  0: No triggered
         *  1: Has been triggered
         */
        uint32_t lp_peri1_pms_exception_det:1;
        /** lp_peri1_pms_exception_id : RO; bitpos: [7:2]; default: 0;
         *  Represents the master id when lp_peri1 pms has been triggered.
         */
        uint32_t lp_peri1_pms_exception_id:6;
        /** lp_peri1_pms_exception_mode : RO; bitpos: [9:8]; default: 0;
         *  Represents the security mode when lp_peri1 pms has been triggered.
         */
        uint32_t lp_peri1_pms_exception_mode:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} lp_peri_pms_lp_peri1_0_reg_t;

/** Type of lp_peri1_1 register
 *  LP_PERI1 PMS exception addr record register
 */
typedef union {
    struct {
        /** lp_peri1_pms_exception_addr : RO; bitpos: [23:0]; default: 0;
         *  Represents the access address (bit27~bit0) when lp_peri1 pms has been triggered.
         */
        uint32_t lp_peri1_pms_exception_addr:24;
        /** lp_peri1_pms_exception_addr_const : HRO; bitpos: [31:24]; default: 32;
         *  Represents the access address (bit31~bit28) when lp_peri1 pms has been triggered.
         */
        uint32_t lp_peri1_pms_exception_addr_const:8;
    };
    uint32_t val;
} lp_peri_pms_lp_peri1_1_reg_t;

/** Type of int_en register
 *  APM interrupt enable register
 */
typedef union {
    struct {
        /** lp_peri1_pms_int_en : R/W; bitpos: [0]; default: 0;
         *  Configures to enable lp_peri1 pms interrupt.
         *  0: disable
         *  1: enable
         */
        uint32_t lp_peri1_pms_int_en:1;
        /** lp_peri0_pms_int_en : R/W; bitpos: [1]; default: 0;
         *  Configures to enable lp_peri0 pms interrupt.
         *  0: disable
         *  1: enable
         */
        uint32_t lp_peri0_pms_int_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_peri_pms_int_en_reg_t;


/** Group: config register */
/** Type of bus_err_conf register
 *  Clock gating register
 */
typedef union {
    struct {
        /** bus_err_resp_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether return error response to cpu when access blocked
         *  0: disable error response
         *  1: enable error response
         */
        uint32_t bus_err_resp_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} lp_peri_pms_bus_err_conf_reg_t;


/** Group: clock gating register */
/** Type of clock_gate register
 *  Clock gating register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  Configures whether to keep the clock always on.
         *  0: enable automatic clock gating
         *  1: keep the clock always on
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} lp_peri_pms_clock_gate_reg_t;


/** Group: Version control register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 38834752;
         *  Version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_peri_pms_date_reg_t;


typedef struct {
    volatile lp_peri_pms_lp_sysreg_ctrl_reg_t lp_sysreg_ctrl;
    volatile lp_peri_pms_lp_aonclkrst_ctrl_reg_t lp_aonclkrst_ctrl;
    volatile lp_peri_pms_lp_anaperi_ctrl_reg_t lp_anaperi_ctrl;
    volatile lp_peri_pms_lp_huk_ctrl_reg_t lp_huk_ctrl;
    volatile lp_peri_pms_lp_pmu_ctrl_reg_t lp_pmu_ctrl;
    volatile lp_peri_pms_lp_touch_aon_ctrl_reg_t lp_touch_aon_ctrl;
    volatile lp_peri_pms_lp_peri_pms_ctrl_reg_t lp_peri_pms_ctrl;
    volatile lp_peri_pms_lp_tee_ctrl_reg_t lp_tee_ctrl;
    volatile lp_peri_pms_lp_apm_ctrl_reg_t lp_apm_ctrl;
    volatile lp_peri_pms_lp_timer_ctrl_reg_t lp_timer_ctrl;
    volatile lp_peri_pms_lp_wdt_ctrl_reg_t lp_wdt_ctrl;
    volatile lp_peri_pms_lp_clk_cali_sosc_ctrl_reg_t lp_clk_cali_sosc_ctrl;
    volatile lp_peri_pms_lp_clk_cali_fosc_ctrl_reg_t lp_clk_cali_fosc_ctrl;
    volatile lp_peri_pms_lp_pwr_reg_ctrl_reg_t lp_pwr_reg_ctrl;
    volatile lp_peri_pms_lp_periclkrst_ctrl_reg_t lp_periclkrst_ctrl;
    volatile lp_peri_pms_lp_iomux_ctrl_reg_t lp_iomux_ctrl;
    volatile lp_peri_pms_lp_intr_ctrl_reg_t lp_intr_ctrl;
    volatile lp_peri_pms_lp_efuse_ctrl_reg_t lp_efuse_ctrl;
    volatile lp_peri_pms_lp_uart_ctrl_reg_t lp_uart_ctrl;
    volatile lp_peri_pms_lp_i2c_ctrl_reg_t lp_i2c_ctrl;
    volatile lp_peri_pms_lp_spi_ctrl_reg_t lp_spi_ctrl;
    volatile lp_peri_pms_lp_i2cmst_ctrl_reg_t lp_i2cmst_ctrl;
    volatile lp_peri_pms_lp_trng_ctrl_reg_t lp_trng_ctrl;
    volatile lp_peri_pms_lp_adc_ctrl_reg_t lp_adc_ctrl;
    volatile lp_peri_pms_lp_touch_ctrl_reg_t lp_touch_ctrl;
    volatile lp_peri_pms_lp_mailbox_ctrl_reg_t lp_mailbox_ctrl;
    volatile lp_peri_pms_lp_tsens_ctrl_reg_t lp_tsens_ctrl;
    volatile lp_peri_pms_lp_ahb_pdma_ctrl_reg_t lp_ahb_pdma_ctrl;
    volatile lp_peri_pms_lp_dac_ctrl_reg_t lp_dac_ctrl;
    uint32_t reserved_074[99];
    volatile lp_peri_pms_lp_peri0_0_reg_t lp_peri0_0;
    volatile lp_peri_pms_lp_peri0_1_reg_t lp_peri0_1;
    volatile lp_peri_pms_lp_peri1_0_reg_t lp_peri1_0;
    volatile lp_peri_pms_lp_peri1_1_reg_t lp_peri1_1;
    uint32_t reserved_210[60];
    volatile lp_peri_pms_int_en_reg_t int_en;
    uint32_t reserved_304[315];
    volatile lp_peri_pms_bus_err_conf_reg_t bus_err_conf;
    uint32_t reserved_7f4;
    volatile lp_peri_pms_clock_gate_reg_t clock_gate;
    volatile lp_peri_pms_date_reg_t date;
} lp_peri_pms_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(lp_peri_pms_dev_t) == 0x800, "Invalid size of lp_peri_pms_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
